{
  "how to join internship": "You can join our internship by registering at https://cloudcounselage.com/internship. You'll receive further instructions via email.",
  "internship registration": "Please register at https://cloudcounselage.com/internship to join.",
  "join internship program": "Please register at https://cloudcounselage.com/internship to get started.",
  
  "is certificate provided": "Yes! A certificate is awarded after successful completion of the internship or training.",
  "do i get certificate": "Yes, you will receive a certificate after completing the internship.",
  
  "internship duration": "The internship typically lasts 4 to 8 weeks, depending on the module.",
  "how long is internship": "It usually lasts between 4 to 8 weeks.",

  "how to login to portal": "Go to https://cloudcounselage.com and click the 'Login' button. Use your registered email and password.",
  "i forgot my password": "Visit the login page and click 'Forgot Password' to reset it.",

  "technologies offered": "We provide training and real-world projects in AI, ML, Cloud Computing, Data Science, Web Development, and more.",
  "what is taught": "We cover AI, Machine Learning, Web Dev, Cloud, Data Science, and more.",

  "project assignment": "Projects are assigned through the student portal once your internship begins.",
  "how to get project": "You'll receive your project details on your registered email or via the portal.",

  "letter of recommendation": "You can request a Letter of Recommendation based on your performance after completing the internship.",
  
  "support contact": "Email support@cloudcounselage.com or use the 'Contact Us' page on the website.",
  "how to contact support": "You can contact us at support@cloudcounselage.com.",
  
  "cloud counselage info": "Cloud Counselage is a career-building platform that offers internships, live projects, and training for students and professionals.",
  "what is cloud counselage": "Cloud Counselage provides real-world learning experiences through training and internships.",

  "placement support": "Yes, Cloud Counselage offers career and placement guidance to high-performing students.",
  
  "payment options": "Most internships are free, but some advanced modules may have minimal fees. Check the program page for details.",
  
  "daily time requirement": "You should dedicate 1–2 hours a day to complete tasks and projects efficiently.",
  
  "internship evaluation": "Evaluation is based on task completion, project performance, and active participation.",

  "how to submit project": "Submit your project through the student portal under the 'Projects' section.",
  
  "internship prerequisites": "Basic knowledge of programming and relevant technologies is recommended but not mandatory for all internships.",
  
  "can i do multiple internships": "Yes, you can apply for multiple internships, but ensure you can manage the workload effectively.",
  
  "internship feedback": "You will receive feedback on your performance throughout the internship via email and the portal.",
  
  "how to update profile": "Log in to your account and go to 'Profile Settings' to update your information.",
  
  "internship start date": "Internships typically start every month. Check the website for specific dates.",
  
  "is internship online": "Yes, all internships are conducted online, allowing you to work from anywhere."
}
